---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.HandRail
source: html/6df5f704-e2ce-bf92-064e-07e827ec6b61.htm
---
# HandRail Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.